from variables import CHAT_TRIGGER_WORD

pupps_info = f'''🤖 *Команды для бота:*
Слово `{CHAT_TRIGGER_WORD}` используется для обращения к боту\\(в лс не обязательно\\)\\.
Умеет распознавать голосовые, видеть картинки и небольшие ролики \\(до 20 мб\\)\\.

🎨 *Генерация картинок:*
• `{CHAT_TRIGGER_WORD} нарисуй [запрос]` — сгенерирует картинку\\. Можно указать разрешение до 1024х1024\\.
• Доступна генерация image\\-2\\-image, можно прикрепить свою картинку чтобы что\\-то изменить в ней\\.
• Доступна генерация reference\\-2\\-image, можно прикрепить 2 картинки, взять деталь от одной и вставить во вторую\\.

📽 *Генерация видео:*
• `{CHAT_TRIGGER_WORD}а анимируй [запрос]` — сгенерирует ролик\\.
• Поддерживаются выбор соотношения сторон и длительность от 2 до 30 сек \\(по умолчанию 10\\)\\. Возможные соотношения: 1:1, 2:3, 3:2, 3:4, 4:3, 9:16 \\(по умолчанию\\), 16:9, 21:9\\.
• Примеры команд:
{CHAT_TRIGGER_WORD} анимируй кота
{CHAT_TRIGGER_WORD} анимируй кота 1:1
{CHAT_TRIGGER_WORD} анимируй кота 12s
{CHAT_TRIGGER_WORD} анимируй кота 9:16 12s

🎵 *Генерация музыки:*
• `{CHAT_TRIGGER_WORD} спой [запрос]` — сгенерирует песню\\.
• Поддерживаются выбор длительности \\(по умолчанию 180 сек\\) и языка \\(по умолчанию ru\\)\\.
• Примеры команд:
{CHAT_TRIGGER_WORD} спой про кота
{CHAT_TRIGGER_WORD} спой про кота 360s
{CHAT_TRIGGER_WORD} спой про кота 360s en

⚡ *Режим авто сообщений:*
• `{CHAT_TRIGGER_WORD} start` — включить авто сообщения с интервалом в 60 мин\\.
• `{CHAT_TRIGGER_WORD} start [число в минутах]` — включить авто сообщения с выбранным интервалом \\(от 30 мин\\)\\.
• `{CHAT_TRIGGER_WORD} stop` — отключить авто сообщения\\.
```
{CHAT_TRIGGER_WORD.capitalize()} будет писать в том топике, в котором была введена команда\\.
Чтобы {CHAT_TRIGGER_WORD.capitalize()} мог писать в закрытый топик, нужно выдать ему админа\\.
```
👑 *Команды для админов:*
• `{CHAT_TRIGGER_WORD} 0` — стереть память боту в текущем канале\\.

• `{CHAT_TRIGGER_WORD} context число` — устанавливает лимит сообщений для Пупса которые он будет помнить\\. По умолчанию 500\\.
Прописав эту команду контекст будет равен указанному числу\\.

• `{CHAT_TRIGGER_WORD} вкл пересказ` — угарный пересказ чата каждый день в 21:00 по Москве\\.
• `{CHAT_TRIGGER_WORD} вкл пересказ 13:45` — угарный пересказ чата каждый день в 13:45 по Москве\\(можно поставить любое время\\)\\.
• `{CHAT_TRIGGER_WORD} выкл пересказ` — отключить ежедневный пересказ\\.
Пересказ не работает в лс и отключается автоматически если чат мёртв в течение суток\\.
Пересказ будет отправляться в топик где была введена команда\\.

• `/setkey gemini` — установить свой ключ для gemini\\.
Эта команда вводится в личку\\.
Ключ брать здесь — `https://aistudio.google.com/`

📢 Новости проекта: @neuro\\_pupps'''